backend/app/Models/CountyModel.php

    public function getCountiesForDropdown()
    {
        return $this->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `counties`
ORDER BY `name` ASC

    public function getByCode(string $code)
    {
        return $this->where('code', $code)->first();
---
SELECT *
FROM `counties`
WHERE `code` = 'TPE'
 LIMIT 1