backend/app/Models/DistrictModel.php

    public function getByCountyId(int $countyId)
    {
        return $this->where('county_id', $countyId)
                   ->orderBy('name', 'ASC')
                   ->findAll();
---
SELECT *
FROM `districts`
WHERE `county_id` = 2
ORDER BY `name` ASC

    public function getByCodeAndCounty(string $code, int $countyId)
    {
        return $this->where('code', $code)
                   ->where('county_id', $countyId)
                   ->first();
---
SELECT *
FROM `districts`
WHERE `code` = 'TPEF0'
AND `county_id` = 19
 LIMIT 1