backend/app/Models/LandPlotModel.php

SELECT *
FROM `land_plots`
WHERE `urban_renewal_id` = '5'
AND `land_plots`.`deleted_at` IS NULL
ORDER BY `is_representative` DESC, `created_at` ASC
---
    public function getLandPlotsByUrbanRenewal($urbanRenewalId)
    {
        return $this->where('urban_renewal_id', $urbanRenewalId)
                   ->orderBy('is_representative', 'DESC')
                   ->orderBy('created_at', 'ASC')
                   ->findAll();