backend/app/Models/OwnerLandOwnershipModel.php

    public function getByPropertyOwnerId(int $propertyOwnerId): array
    {
        $result = $this->where('property_owner_id', $propertyOwnerId)
                       ->findAll();
---
SELECT *
FROM `owner_land_ownership`
WHERE `property_owner_id` = 3
AND `deleted_at` IS NULL
AND `owner_land_ownership`.`deleted_at` IS NULL