backend/app/Models/PropertyOwnerModel.php

SELECT *
FROM `property_owners`
WHERE `owner_code` = 'OW2509148988'
AND `property_owners`.`deleted_at` IS NULL
 LIMIT 1
---
    private function generateUniqueOwnerCode(): string
    {
        do {
            $timestamp = date('ymd');
            $randomNum = str_pad(mt_rand(1, 9999), 4, '0', STR_PAD_LEFT);
            $code = 'OW' . $timestamp . $randomNum;
        } while ($this->where('owner_code', $code)->first());

SELECT *
FROM `property_owners`
WHERE `urban_renewal_id` = 5
AND `deleted_at` IS NULL
AND `property_owners`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function getByUrbanRenewalId(int $urbanRenewalId): array
    {
        return $this->where('urban_renewal_id', $urbanRenewalId)
                    ->where('deleted_at', null)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();

SELECT *
FROM `property_owners`
WHERE `property_owners`.`deleted_at` IS NULL
AND `property_owners`.`id` = 3
---
    public function getWithDetails(int $id): ?array
    {
        $owner = $this->find($id);