backend/app/Models/SectionModel.php

    public function getByDistrictId(int $districtId)
    {
        return $this->where('district_id', $districtId)
                   ->orderBy('name', 'ASC')
                   ->findAll();
---
SELECT *
FROM `sections`
WHERE `district_id` = 134
ORDER BY `name` ASC