backend/app/Models/UrbanRenewalModel.php

SELECT *
FROM `urban_renewals`
WHERE `urban_renewals`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `urban_renewals`
WHERE `urban_renewals`.`deleted_at` IS NULL
---
    public function getUrbanRenewals($page = 1, $perPage = 10, $urbanRenewalId = null)
    {
        $builder = $this->orderBy('created_at', 'DESC');

        // Support both old parameter name (for backward compatibility) and new usage
        if ($urbanRenewalId !== null) {
            // If this looks like it's being used as company_id, use it that way
            $builder->where('company_id', $urbanRenewalId);
        }

        return $builder->paginate($perPage, 'default', $page);

SELECT *
FROM `urban_renewals`
WHERE `urban_renewals`.`deleted_at` IS NULL
AND `urban_renewals`.`id` = '5'
---
    public function getUrbanRenewal($id)
    {
        return $this->find($id);