backend/app/Controllers/Api/LandPlotController.php

    public function index($urbanRenewalId = null)
    {
        try {
            // Get authenticated user
            $user = $_SERVER['AUTH_USER'] ?? null;
            $isAdmin = $user && isset($user['role']) && $user['role'] === 'admin';
            $isCompanyManager = $user && isset($user['is_company_manager']) && $user['is_company_manager'] == 1;

            if (!$urbanRenewalId) {
                return $this->response->setStatusCode(400)->setJSON([
                    'status' => 'error',
                    'message' => '缺少更新會ID參數'
                ]);
            }

            // Check if urban renewal exists
            $urbanRenewal = $this->urbanRenewalModel->find($urbanRenewalId);
---
SELECT *
FROM `urban_renewals`
WHERE `urban_renewals`.`deleted_at` IS NULL
AND `urban_renewals`.`id` = '5'